btheobald/atlas/atlas_dev/atlas_dev.ioc
#MicroXplorer Configuration settings - do not modify
PB13.GPIOParameters=GPIO_Label
PD12.GPIO_Label=USART3_RTS_NCP
PH0-OSC_IN.Signal=RCC_OSC_IN
SPI4.VirtualType=VM_MASTER
PC12.Signal=SDMMC1_CK
PB14.GPIO_Label=STM_VCORE_D1
RCC.PLLFRACN=1
PD3.GPIOParameters=GPIO_Label
PA13(JTMS/SWDIO).Signal=DEBUG_JTMS-SWDIO
VP_RTC_VS_RTC_Activate.Mode=RTC_Enabled
RCC.RTCFreq_Value=32.77
PB6.GPIO_Label=I2C4_SCL_SENSOR_PB6
PD4.Locked=true
RCC.CpuClockFreq_Value=512000488.28125
PC5.Mode=OCTOSPI1_Port1_DQS
PB13.Signal=GPIO_Output
PD6.GPIO_Label=ACCEL_INT2
PA2.GPIOParameters=GPIO_Label
PinOutPanel.RotationAngle=0
RCC.MCO1PinFreq_Value=64000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
RCC.AHB4Freq_Value=256000244.140625
RCC.SPI123CLockSelection=RCC_SPI123CLKSOURCE_PLL2
RCC.LPTIM1Freq_Value=128000122.0703125
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:true\:false\:false
I2C4.Timing=0x20A0A7FC
RCC.I2C4Freq_Value=128000122.0703125
PE2.Mode=Full_Duplex_Master
TIM2.IPParameters=Channel-PWM Generation4 CH4
PD4.Signal=GPIO_Output
PB6.Signal=I2C4_SCL
PC7.Signal=LTDC_G6
PB6.Mode=I2C
RCC.DIVQ3Freq_Value=96750000
PD0.Signal=GPIO_Input
PD8.Signal=USART3_TX
PE5.Signal=SPI4_MISO
PE1.Signal=UART8_TX
ProjectManager.ProjectBuild=false
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA0.Locked=true
PB2.Signal=OCTOSPIM_P1_CLK
PD1.GPIOParameters=GPIO_Label
RCC.DIVM1=12
RCC.RTCClockSelection=RCC_RTCCLKSOURCE_LSE
PD1.GPIO_Label=SD_VSEL
PB12.GPIO_Label=STM_VCORE_EN
ProjectManager.FirmwarePackage=STM32Cube FW_H7 V1.8.0
MxDb.Version=DB.6.0.10
PE0.GPIOParameters=GPIO_Label
PA1.GPIOParameters=GPIO_Label
ProjectManager.BackupPrevious=false
RCC.FMCFreq_Value=256000244.140625
PC4.GPIO_Label=LED_R
PE9.Signal=OCTOSPIM_P1_IO6
PB3(JTDO/TRACESWO).Signal=DEBUG_JTDO-SWO
RCC.USART16Freq_Value=128000122.0703125
PE4.GPIO_Label=SPI4_NCS_FLASH
PC9.Mode=SD_4_bits_Wide_bus_auto_dir_voltage_converter
PE2.Signal=SPI4_SCK
PA8.Signal=LTDC_R6
PE1.Locked=true
NVIC.PendSV_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.PLL2_VCO_SEL-AdvancedSettings=RCC_PLL2VCOWIDE
USB_OTG_HS.IPParameters=VirtualMode-Device_Only_FS
RCC.DIVR2Freq_Value=96750000
PE10.Signal=OCTOSPIM_P1_IO7
ProjectManager.HalAssertFull=false
RCC.DIVP2Freq_Value=96750000
PA0.Signal=GPIO_Input
RCC.MCO2PinFreq_Value=512000488.28125
Mcu.Package=LQFP100
PB9.Signal=LTDC_B7
PB1.Signal=OCTOSPIM_P1_IO0
RCC.PLL3FRACN=0
PD12.Signal=USART3_RTS
PD5.GPIOParameters=GPIO_Label
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
PC3_C.GPIO_Label=LED_C
PE9.Mode=OCTOSPI1_IOH_Port1H
RCC.DFSDMFreq_Value=128000122.0703125
PC11.Mode=SD_4_bits_Wide_bus_auto_dir_voltage_converter
PB14.GPIOParameters=GPIO_Label
RCC.TraceFreq_Value=256000244.140625
RCC.APB4Freq_Value=128000122.0703125
RCC.CECFreq_Value=32000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
RCC.LPUART1Freq_Value=128000122.0703125
SH.S_TIM2_CH4.ConfNb=1
PD5.Locked=true
ProjectManager.CustomerFirmwarePackage=
PC4.GPIOParameters=GPIO_Label
RCC.VCO3OutputFreq_Value=193500000
PD6.GPIOParameters=GPIO_Label
Mcu.Pin80=VP_RTC_VS_RTC_Activate
Mcu.Pin81=VP_SYS_VS_Systick
ProjectManager.ProjectFileName=atlas_dev.ioc
RCC.DIVQ1=1
Mcu.Pin79=VP_OCTOSPI1_VS_hyperbus
PD9.GPIO_Label=USART3_RX_NCP
Mcu.PinsNb=82
Mcu.Pin73=PB6
Mcu.Pin74=PB7
Mcu.Pin71=PB4(NJTRST)
Mcu.Pin72=PB5
PC13.Locked=true
Mcu.Pin77=PE0
Mcu.Pin78=PE1
Mcu.Pin75=PB8
PC13.Signal=GPIO_Input
Mcu.Pin76=PB9
RCC.SWPMI1Freq_Value=128000122.0703125
PD3.Signal=LTDC_G7
Mcu.Pin70=PB3(JTDO/TRACESWO)
PC6.Signal=LTDC_HSYNC
PE10.Mode=OCTOSPI1_IOH_Port1H
PD13.GPIOParameters=GPIO_Label
PD7.Signal=GPIO_Input
PD1.Signal=GPIO_Output
RCC.DIVP1=1
Mcu.Pin68=PD6
Mcu.Pin69=PD7
PC0.Signal=GPIO_Output
PC14-OSC32_IN.Signal=RCC_OSC32_IN
RCC.QSPIFreq_Value=256000244.140625
Mcu.Pin62=PD0
USB_OTG_HS.VirtualMode-Device_Only_FS=Device_Only_FS
Mcu.Pin63=PD1
PB4(NJTRST).Signal=GPIO_Output
Mcu.Pin60=PC11
Mcu.Pin61=PC12
Mcu.Pin66=PD4
Mcu.Pin67=PD5
Mcu.Pin64=PD2
Mcu.Pin65=PD3
PE8.Mode=OCTOSPI1_IOH_Port1H
PD10.Signal=GPIO_Input
RCC.D1CPREFreq_Value=512000488.28125
RCC.USART234578Freq_Value=128000122.0703125
RCC.Tim1OutputFreq_Value=256000244.140625
Mcu.Pin59=PC10
Mcu.Pin57=PA14(JTCK/SWCLK)
RCC.SPI123Freq_Value=96750000
Mcu.Pin58=PA15(JTDI)
Mcu.Pin51=PC9
Mcu.Pin52=PA8
PC3_C.GPIOParameters=GPIO_Label
Mcu.Pin50=PC8
Mcu.Pin55=PA12
Mcu.Pin56=PA13(JTMS/SWDIO)
Mcu.Pin53=PA9
Mcu.Pin54=PA11
PA9.Signal=LTDC_R5
RCC.DIVN1=128
SPI4.VirtualNSS=VM_NSSHARD
VP_OCTOSPI1_VS_hyperbus.Signal=OCTOSPI1_VS_hyperbus
PD7.Locked=true
Mcu.Pin48=PC6
Mcu.Pin49=PC7
Mcu.Pin46=PD12
Mcu.Pin47=PD13
PB10.Signal=LTDC_G4
PB14.Signal=GPIO_Output
PA5.Signal=LTDC_R4
Mcu.Pin40=PB14
Mcu.Pin41=PB15
Mcu.Pin44=PD10
PC12.Mode=SD_4_bits_Wide_bus_auto_dir_voltage_converter
Mcu.Pin45=PD11
Mcu.Pin42=PD8
Mcu.Pin43=PD9
PE1.GPIO_Label=GPS_UART8_TX
ProjectManager.LastFirmware=true
PC2_C.GPIO_Label=SW_L
RCC.AHB12Freq_Value=256000244.140625
PE14.Signal=LTDC_CLK
PE6.Mode=Full_Duplex_Master
PE15.Signal=LTDC_R7
Mcu.Pin37=PB11
Mcu.Pin38=PB12
Mcu.Pin35=PE15
PB15.GPIO_Label=STM_VCORE_D0
PE8.Signal=OCTOSPIM_P1_IO5
Mcu.Pin36=PB10
Mcu.Pin39=PB13
RCC.RNGFreq_Value=48000000
Mcu.Pin30=PE10
PA1.GPIO_Label=SW_R
Mcu.Pin33=PE13
Mcu.Pin34=PE14
Mcu.Pin31=PE11
Mcu.Pin32=PE12
PA9.Locked=true
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false
PA14(JTCK/SWCLK).Mode=Trace_Asynchronous_SW
ProjectManager.FreePins=false
RCC.LPTIM2Freq_Value=128000122.0703125
Mcu.Pin26=PB2
Mcu.Pin27=PE7
Mcu.Pin24=PB0
ProjectManager.UnderRoot=false
Mcu.Pin25=PB1
Mcu.Pin28=PE8
Mcu.Pin29=PE9
PC8.Mode=SD_4_bits_Wide_bus_auto_dir_voltage_converter
PA4.Signal=LTDC_VSYNC
PB5.Signal=LTDC_B5
Mcu.Pin22=PC4
Mcu.Pin23=PC5
Mcu.Pin20=PA6
PA3.Locked=true
Mcu.Pin21=PA7
PD10.Locked=true
VP_OCTOSPI1_VS_hyperbus.Mode=hyperbus_mode
NVIC.ForceEnableDMAVector=true
PD11.Signal=USART3_CTS
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false
ProjectManager.CompilerOptimize=6
PA11.Signal=USB_OTG_HS_DM
ProjectManager.HeapSize=0x200
Mcu.Pin15=PA1
PA0.GPIOParameters=GPIO_Label
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.Pin16=PA2
PB1.Mode=OCTOSPI1_IOL_Port1L
Mcu.Pin13=PC3_C
Mcu.Pin14=PA0
Mcu.Pin19=PA5
RCC.LPTIM345Freq_Value=128000122.0703125
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PA3
Mcu.Pin18=PA4
RCC.LTDCFreq_Value=96750000
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PC1
Mcu.Pin12=PC2_C
PD0.GPIOParameters=GPIO_Label
PB8.Mode=SD_4_bits_Wide_bus_auto_dir_voltage_converter
Mcu.Pin10=PC0
PE3.Signal=GPIO_Output
PA14(JTCK/SWCLK).Signal=DEBUG_JTCK-SWCLK
PD2.Signal=SDMMC1_CMD
RCC.HCLK3ClockFreq_Value=256000244.140625
PB0.Signal=OCTOSPIM_P1_IO1
PC0.Locked=true
PC1.Signal=GPIO_Output
PB12.GPIOParameters=GPIO_Label
PD7.GPIOParameters=GPIO_Label
Mcu.Family=STM32H7
RCC.DIVQ2Freq_Value=96750000
ProjectManager.MainLocation=Core/Src
PA6.Mode=OCTOSPI1_IOL_Port1L
RCC.SAI1Freq_Value=512000488.28125
RCC.CortexFreq_Value=512000488.28125
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32H723VGTx
PD9.GPIOParameters=GPIO_Label
RCC.HPRE=RCC_HCLK_DIV2
PA15(JTDI).Signal=LTDC_B6
PC10.Signal=SDMMC1_D2
SPI4.Direction=SPI_DIRECTION_2LINES
PA0.GPIO_Label=SW_PWR_C
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-SystemClock_Config-RCC-false-HAL-false,3-MX_I2C4_Init-I2C4-false-HAL-true,4-MX_OCTOSPI1_Init-OCTOSPI1-false-HAL-true,5-MX_SDMMC1_SD_Init-SDMMC1-false-HAL-true,6-MX_USB_OTG_HS_PCD_Init-USB_OTG_HS-false-HAL-true,7-MX_LPUART1_UART_Init-LPUART1-false-HAL-true,8-MX_RTC_Init-RTC-false-HAL-true,9-MX_SPI4_Init-SPI4-false-HAL-true,10-MX_ADC1_Init-ADC1-false-HAL-true,11-MX_TIM2_Init-TIM2-false-HAL-true,0-MX_CORTEX_M7_Init-CORTEX_M7-false-HAL-true
PC0.GPIOParameters=GPIO_Label
PD0.GPIO_Label=SD_DET
PC0.GPIO_Label=LED_L
PA11.Mode=Device_Only_FS
PD6.Locked=true
RCC.PLL2FRACN=0
RCC.VCO2OutputFreq_Value=193500000
PC13.GPIO_Label=TOUCH_INT
PB13.GPIO_Label=STM_VCORE_D2
PB11.Signal=LTDC_G5
PB15.Signal=GPIO_Output
ProjectManager.StackSize=0x400
PB4(NJTRST).GPIOParameters=GPIO_Label
RCC.VCOInput3Freq_Value=1500000
PA13(JTMS/SWDIO).Mode=Trace_Asynchronous_SW
PD13.Signal=GPIO_Output
Mcu.IP4=OCTOSPI1
Mcu.IP5=PWR
Mcu.IP2=I2C4
PD13.Locked=true
Mcu.IP3=NVIC
Mcu.IP0=CORTEX_M7
Mcu.IP1=DEBUG
PA12.Signal=USB_OTG_HS_DP
PE4.GPIOParameters=GPIO_Label
Mcu.UserConstants=
PE11.Mode=OCTOSPI1_Port1_NCS
SPI4.Mode=SPI_MODE_MASTER
PC1.GPIOParameters=GPIO_Label
RCC.DIVP3Freq_Value=96750000
RCC.SDMMCFreq_Value=512000488.28125
Mcu.ThirdPartyNb=0
RCC.HCLKFreq_Value=256000244.140625
PD11.GPIO_Label=USART3_CTS_NCP
Mcu.IPNb=13
ProjectManager.PreviousToolchain=
RCC.SPDIFRXFreq_Value=512000488.28125
PD8.GPIOParameters=GPIO_Label
Mcu.Pin6=PC14-OSC32_IN
Mcu.Pin7=PC15-OSC32_OUT
Mcu.Pin8=PH0-OSC_IN
Mcu.Pin9=PH1-OSC_OUT
SPI4.IPParameters=VirtualType,Mode,Direction,CalculateBaudRate,VirtualNSS
PC2_C.Signal=GPIO_Input
PH0-OSC_IN.Mode=HSE-External-Oscillator
Mcu.Pin0=PE2
Mcu.Pin1=PE3
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PE4
Mcu.Pin3=PE5
Mcu.Pin4=PE6
PD10.GPIOParameters=GPIO_Label
Mcu.Pin5=PC13
RCC.DIVR3Freq_Value=96750000
RCC.HSE_VALUE=48000000
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false
Mcu.IP10=SYS
NVIC.SysTick_IRQn=true\:0\:0\:false\:false\:true\:false\:true
Mcu.IP12=USB_OTG_HS
Mcu.IP11=TIM2
RCC.DIVP1Freq_Value=512000488.28125
PE13.Signal=LTDC_DE
PC14-OSC32_IN.Mode=LSE-External-Oscillator
File.Version=6
PE3.GPIOParameters=GPIO_Label
PE3.Locked=true
PB7.Signal=I2C4_SDA
PE4.Mode=NSS_Signal_Hard_Output
PE4.Signal=SPI4_NSS
PB6.GPIOParameters=GPIO_Label
PC2_C.Locked=true
ProjectManager.ProjectName=atlas_dev
PD7.GPIO_Label=ACCEL_INT1
RCC.APB3Freq_Value=128000122.0703125
PB7.GPIO_Label=I2C4_SDA_SENSOR_PB7
PH1-OSC_OUT.Mode=HSE-External-Oscillator
PD13.GPIO_Label=LCD_REG_EN
PA6.Signal=OCTOSPIM_P1_IO3
RCC.D1PPRE=RCC_APB3_DIV2
PD5.GPIO_Label=GPS_FORCE_ON
PB3(JTDO/TRACESWO).Mode=Trace_Asynchronous_SW
ProjectManager.ToolChainLocation=
PA2.GPIO_Label=USB_DET
RCC.DIVR1Freq_Value=256000244.140625
PE0.GPIO_Label=GPS_UART8_RX
PC4.Locked=true
PC5.Signal=OCTOSPIM_P1_DQS
PD3.GPIO_Label=LTDC_G7
PB4(NJTRST).Locked=true
PE7.Signal=OCTOSPIM_P1_IO4
PD6.Signal=GPIO_Input
RCC.Tim2OutputFreq_Value=256000244.140625
RCC.DFSDMACLkFreq_Value=512000488.28125
PA3.Signal=S_TIM2_CH4
VP_RTC_VS_RTC_Activate.Signal=RTC_VS_RTC_Activate
PC15-OSC32_OUT.Mode=LSE-External-Oscillator
TIM2.Channel-PWM\ Generation4\ CH4=TIM_CHANNEL_4
PA7.Mode=OCTOSPI1_IOL_Port1L
PB4(NJTRST).GPIO_Label=FUEL_INT
ProjectManager.NoMain=false
PC11.Signal=SDMMC1_D3
RCC.SAI4BFreq_Value=512000488.28125
PC8.Signal=SDMMC1_D0
PC4.Signal=GPIO_Output
PC10.Mode=SD_4_bits_Wide_bus_auto_dir_voltage_converter
RCC.D2PPRE2=RCC_APB2_DIV2
RCC.D2PPRE1=RCC_APB1_DIV2
ProjectManager.DefaultFWLocation=true
PD5.Signal=GPIO_Output
PD9.Signal=USART3_RX
ProjectManager.DeletePrevious=true
RCC.FamilyName=M
PD8.GPIO_Label=USART3_TX_NCP
RCC.SPI6Freq_Value=128000122.0703125
RCC.SPI45Freq_Value=128000122.0703125
PD12.GPIOParameters=GPIO_Label
ProjectManager.TargetToolchain=Makefile
RCC.VCO1OutputFreq_Value=512000488.28125
PC3_C.Locked=true
PB7.GPIOParameters=GPIO_Label
RCC.AXIClockFreq_Value=256000244.140625
ProjectManager.RegisterCallBack=
PE0.Locked=true
RCC.USBFreq_Value=512000488.28125
PD10.GPIO_Label=STM_VCORE_GOOD
PE11.Signal=OCTOSPIM_P1_NCS
RCC.LSE_VALUE=32.77
PC15-OSC32_OUT.Signal=RCC_OSC32_OUT
PA1.Signal=GPIO_Input
RCC.CKPERFreq_Value=64000000
PD2.Mode=SD_4_bits_Wide_bus_auto_dir_voltage_converter
PB0.Mode=OCTOSPI1_IOL_Port1L
board=custom
PD11.GPIOParameters=GPIO_Label
RCC.VCOInput1Freq_Value=4000000
RCC.APB2Freq_Value=128000122.0703125
MxCube.Version=6.1.1
PC13.GPIOParameters=GPIO_Label
PD4.GPIO_Label=GPS_EXTINT0
RCC.FDCANFreq_Value=512000488.28125
PE5.Mode=Full_Duplex_Master
RCC.ADCFreq_Value=96750000
PC1.GPIO_Label=MCU_3V3_EN
PD4.GPIOParameters=GPIO_Label
VP_SYS_VS_Systick.Mode=SysTick
PH1-OSC_OUT.Signal=RCC_OSC_OUT
SPI4.CalculateBaudRate=64.00006 MBits/s
PE6.Signal=SPI4_MOSI
PB15.GPIOParameters=GPIO_Label
RCC.IPParameters=ADCFreq_Value,AHB12Freq_Value,AHB4Freq_Value,APB1Freq_Value,APB2Freq_Value,APB3Freq_Value,APB4Freq_Value,AXIClockFreq_Value,CECFreq_Value,CKPERFreq_Value,CortexFreq_Value,CpuClockFreq_Value,D1CPREFreq_Value,D1PPRE,D2PPRE1,D2PPRE2,D3PPRE,DFSDMACLkFreq_Value,DFSDMFreq_Value,DIVM1,DIVN1,DIVP1,DIVP1Freq_Value,DIVP2Freq_Value,DIVP3Freq_Value,DIVQ1,DIVQ1Freq_Value,DIVQ2Freq_Value,DIVQ3Freq_Value,DIVR1Freq_Value,DIVR2Freq_Value,DIVR3Freq_Value,FDCANFreq_Value,FMCFreq_Value,FamilyName,HCLK3ClockFreq_Value,HCLKFreq_Value,HPRE,HSE_VALUE,I2C123Freq_Value,I2C4Freq_Value,LPTIM1Freq_Value,LPTIM2Freq_Value,LPTIM345Freq_Value,LPUART1Freq_Value,LSE_VALUE,LTDCFreq_Value,MCO1PinFreq_Value,MCO2PinFreq_Value,PLL2FRACN,PLL2_VCO_SEL-AdvancedSettings,PLL3FRACN,PLLFRACN,QSPIFreq_Value,RNGFreq_Value,RTCClockSelection,RTCFreq_Value,SAI1Freq_Value,SAI4AFreq_Value,SAI4BFreq_Value,SDMMCFreq_Value,SPDIFRXFreq_Value,SPI123CLockSelection,SPI123Freq_Value,SPI45Freq_Value,SPI6Freq_Value,SWPMI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,Tim1OutputFreq_Value,Tim2OutputFreq_Value,TraceFreq_Value,USART16Freq_Value,USART234578Freq_Value,USBFreq_Value,VCO1OutputFreq_Value,VCO2OutputFreq_Value,VCO3OutputFreq_Value,VCOInput1Freq_Value,VCOInput2Freq_Value,VCOInput3Freq_Value
ProjectManager.AskForMigrate=true
PE0.Signal=UART8_RX
Mcu.Name=STM32H723VGTx
PE12.Signal=LTDC_B4
PA2.Signal=PWR_WKUP2
Mcu.IP8=SDMMC1
Mcu.IP9=SPI4
Mcu.IP6=RCC
Mcu.IP7=RTC
ProjectManager.CoupleFile=true
RCC.SYSCLKFreq_VALUE=512000488.28125
PE7.Mode=OCTOSPI1_IOH_Port1H
RCC.I2C123Freq_Value=128000122.0703125
PA1.Locked=true
PA12.Mode=Device_Only_FS
KeepUserPlacement=false
PB2.Mode=O1_P1_CLK
PB7.Mode=I2C
SH.S_TIM2_CH4.0=TIM2_CH4,PWM Generation4 CH4
RCC.SAI4AFreq_Value=512000488.28125
PC3_C.Signal=GPIO_Output
RCC.DIVQ1Freq_Value=512000488.28125
PC2_C.GPIOParameters=GPIO_Label
PA2.Mode=WakeUp2
PB8.Signal=SDMMC1_CKIN
PE3.GPIO_Label=SPI4_NCS_ACCEL
RCC.D3PPRE=RCC_APB4_DIV2
PC9.Signal=SDMMC1_D1
RCC.VCOInput2Freq_Value=1500000
RCC.APB1Freq_Value=128000122.0703125
ProjectManager.DeviceId=STM32H723VGTx
PB12.Signal=GPIO_Output
ProjectManager.LibraryCopy=1
I2C4.IPParameters=Timing
PE1.GPIOParameters=GPIO_Label
PA7.Signal=OCTOSPIM_P1_IO2
